app/views/trips/show.erb

SELECT "photos".* FROM "photos" WHERE "photos"."trip_id" = ?  [["trip_id", 21]]
---

<% @trip.photos.each do |photo| %>