app/views/users/show.erb

<% if @user == current_user %>
    <% @user.trips.each do |trip| %>
---
SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = ?  [["user_id", 3]]

<% else %>
    <% @user.trips.each do |trip| %>
---
SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = ?  [["user_id", 2]]