app/helpers/application_helper.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def current_user
        @current_user ||= User.find_by_id(session[:user_id]) if !!session[:user_id]