app/controllers/photos_controller.rb

SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def new
        @trip = Trip.find_by_id(params[:trip_id] )

SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "photos" ("category", "trip_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category", "landscape"], ["trip_id", 1], ["created_at", "2021-09-19 02:50:23.505863"], ["updated_at", "2021-09-19 02:50:23.505863"]]
---
    def create

        @trip = Trip.find_by_id(params[:trip_id] )
        @photo = Photo.new(photo_params)
        if @photo.save

DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 1]]
---
    def destroy
        @photo.destroy

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def find_photo
        @photo = Photo.find(params[:id])