app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "j@gmail.com"], ["LIMIT", 1]]
---
    def create
      @user = User.find_by_email(params[:email])

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
    def destroy
      session.delete :user_id