app/controllers/trips_controller.rb

    def find_trip
        @trip = Trip.find(params[:id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]