app/controllers/trips_controller.rb

    def new
        @user = User.find_by_id(params[:user_id] )
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def create
        @user = User.find_by_id(params[:user_id] )
        @trip = Trip.new(trip_params)
        if @trip.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "trips" ("location", "date", "private", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["location", "Denver"], ["date", "asdf"], ["private", 1], ["user_id", 2], ["created_at", "2021-09-19 01:23:10.684507"], ["updated_at", "2021-09-19 01:23:10.684507"]]

    def show
        @user = User.find_by_id(params[:user_id] )
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def destroy
        @trip.destroy
        @user = User.find_by_id(params[:user_id] )
---
DELETE FROM "trips" WHERE "trips"."id" = ?  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def find_trip
        @trip = Trip.find(params[:id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]